UML Class Diagrams/useCaseDiagrams.md
```mermaid
graph LR

        style LU fill-opacity:0, stroke-opacity:0;
        style LS fill-opacity:0, stroke-opacity:0;
        style LI fill-opacity:0, stroke-opacity:0;
        style LS_UP fill-opacity:0, stroke-opacity:0;
        direction LR  %%
        LU([fa:fa-user Bank App User]) --- childLU_1([enter user credentials])
        LU([fa:fa-user Bank App User]) --- childLU_3([press submit button])

        LI([fa:fa-user Login Interface]) --- childLI_1([display username input field])
        LI([fa:fa-user Login Interface]) --- childLI_2([display password input field])
        LI([fa:fa-user Login Interface]) --- childLI_3([store user input])

        LS([fa:fa-user Login Backend]) --- childLS_1([receive user credentials])
        LS([fa:fa-user Login Backend]) --- childLS_2([validate login request])
        LS([fa:fa-user Login Backend]) --- childLS_3([fetch stored credentials])
        LS([fa:fa-user Login Backend]) --- childLS_4([verify inputted credentials])
        LS([fa:fa-user Login Backend]) --- childLS_5([generate authentication token])
        LS([fa:fa-user Login Backend]) --- childLS_6([hash and provide security features to user information like name and password])
        LS([fa:fa-user Login Backend]) --- childLS_7([load in user profile])

        LS_UP([fa:fa-user User Profile Backend]) --- childUP_1([store user email])
        LS_UP([fa:fa-user User Profile Backend]) --- childUP_2([store user notification preferences])
        LS_UP([fa:fa-user User Profile Backend]) --- childUP_3([store user phone number])
```
